Autodesk.Revit.AXMImporterServiceData.GetOutputPath
Retrieves the output path of the converted ATFXML file.

Autodesk.Revit.AXMImporterServiceData.SetOutputPath(System.String)
Sets the output path of the converted ATFXML file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.AXMImporterServiceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.AXMImporterServiceData.OnlyVisibleLayers
If only visible layers will be imported into Revit.

Autodesk.Revit.AXMImporterServiceData.CreateMassFloors
If mass floors will be created in Revit.

Autodesk.Revit.AXMImporterServiceData.ImportLevels
If levels in AXM file will be imported into Revit.

Autodesk.Revit.AXMImporterServiceData.FilePath
The path of the AXM file to import.

Autodesk.Revit.AXMImporterServiceData.Document
The current document.

Autodesk.Revit.AXMImporterServiceData
The data associated with the AXM importer service.